cask_args appdir: "~/Applications"

tap "caskroom/cask"
tap "caskroom/drivers"
tap "caskroom/versions"
tap "crisidev/homebrew-chunkwm"
tap "neovim/neovim"

cask "1password"
cask "alfred"
cask "bartender"
cask "basecamp"
cask "brave"
cask "command-tab-plus"
cask "docker"
cask "dropbox"
cask "firefox"
cask "firefoxdeveloperedition"
cask "font-hack"
cask "github-desktop"
cask "google-chrome"
cask "iterm2-beta"
cask "java" unless system "/usr/libexec/java_home --failfast"
cask "keepassxc"
cask "kitematic"
cask "little-snitch"
cask "slack"
cask "spillo"
cask "steam"
cask "totalspaces"
cask "transmission"
cask "transmit"
cask "ubersicht"
cask "viscosity"
cask "dash"
cask "marked"
cask "spotify"
cask "ngrok"
cask "karabiner-elements"
cask "backblaze"
cask "swinsian"
cask "qlmarkdown"
cask "kindle"
cask "plex-media-player"
cask "synology-cloud-station-drive"
cask "hermes"
cask "kitty"
cask "steermouse"
cask "hazeover"
cask "gpg-suite"
cask "keybase"
cask "focuswriter"
cask "vivaldi"
cask "zoomus"

brew "rcm"
brew "vim", args: ["with-python3"]
brew "neovim"
brew "tmux"
brew "rbenv"
brew "ruby-build"
brew "nvm"
brew "postgresql" # Don't start the service.
brew "irssi"
brew "mutt"
brew "newsboat"
brew "openssl"
brew "awscli"
brew "reattach-to-user-namespace"
brew "direnv"
brew "htop"
brew "neofetch"
brew "ctags"
brew "python"
brew "python3"
brew "node"
brew "jq"
brew "yarn"
brew "ansible"
brew "chunkwm"
brew "heroku"
