cask_args appdir: "~/Applications"

tap "caskroom/cask"
tap "neovim/neovim"
tap "caskroom/versions"

cask "1password"
cask "alfred"
cask "bartender"
cask "basecamp"
cask "brave"
cask "command-tab-plus"
cask "docker"
cask "dropbox"
cask "firefox"
cask "font-hack"
cask "github-desktop"
cask "google-chrome"
cask "iterm2-beta"
cask "java" unless system "/usr/libexec/java_home --failfast"
cask "keepassx"
cask "kitematic"
cask "little-snitch"
cask "slack"
cask "spillo"
cask "steam"
cask "totalspaces"
cask "transmission"
cask "transmit"
cask "ubersicht"
cask "viscosity"
cask "dash"
cask "marked"
cask "spotify"
cask "ngrok"
cask "karabiner-elements"
cask "crashplan"
cask "swinsian"

brew "rcm"
brew "vim"
brew "neovim"
brew "tmux"
brew "rbenv"
brew "ruby-build"
brew "nvm"
brew "postgresql" # Don't start the service.
brew "irssi"
brew "mutt"
brew "openssl"
brew "awscli"
brew "reattach-to-user-namespace"
brew "direnv"
brew "htop"
brew "neofetch"
brew "ctags"
brew "python"
brew "node"
brew "jq"
brew "ansible"
